<?php

namespace Database\Seeders;

use App\Models\StillSmoking;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class StillSmokingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $stillSmoking = [
            'إدمان النيكوتين',
            'السلوك المعتاد',
            'الاتصالات الاجتماعية',
            'تخفيف التوتر',
            'الخوف من الانسحاب',
            'معتقدات التحكم في الوزن: المخاوف بشأن زيادة الوزن بعد الإقلاع عن التدخين يمكن أن تمنع الأفراد من الإقلاع عن التدخين.',
            'القبول الثقافي: في الثقافات التي يتم فيها قبول التدخين على نطاق واسع، قد يستمر الأفراد في التدخين بسبب الأعراف الاجتماعية.',
            'صعوبة كسر الروتين',
            'الاعتماد النفسي',
            'الاستثمار المالي: قد يرى المدخنون منذ فترة طويلة أن استثمارهم في منتجات التبغ سبب للاستمرار في التدخين.',
            'ضغط الأقران: يمكن للدوائر الاجتماعية التي لا تزال تضم مدخنين أن تمارس الضغط لمواصلة التدخين.',
            'التعامل مع العواطف',
            'توافر السجائر',
            'الهوية: يمكن أن يتشابك التدخين مع هوية الشخص، مما يجعل من الصعب تصور الحياة بدونه.',
            'إنكار المخاطر الصحية: قد ينكر بعض المدخنين على المدى الطويل أو يقللون من المخاطر الصحية المرتبطة بالتدخين.',
            'المتعة الملموسة: على الرغم من المخاطر الصحية، قد يستمر الأفراد في التدخين بسبب المتعة أو المتعة المرتبطة بالتدخين.',
            'الخوف من الفشل: المحاولات السابقة غير الناجحة للإقلاع عن التدخين قد تثبط الجهود الإضافية للإقلاع عن التدخين.',
            'عدم وجود الحافز',
            'اخرى'
        ];

        foreach ($stillSmoking as $stillSmoking) {
            StillSmoking::query()->create(['still_smoking_response' => $stillSmoking]);
        }
    }
}
